Configuration/Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.Реализация</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Управляет логикой формы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Тип ограничивается в коде по виду операции</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>Отбор по Владельцу; скрывать по условию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Вводится вручную (нет ТЧ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Автозаполнение текущим пользователем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Enums/ВидыОперацийРасходаДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходаДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Documents/РасходныйКассовыйОрдер/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
    ВидОп = Объект.ВидОперации;
    НуженСотрудник = (ВидОп = Перечисления.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику)
                  Или (ВидОп = Перечисления.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты);

    ДопТипы = Новый Массив;
    Если НуженСотрудник Тогда
        ДопТипы.Добавить(Тип("СправочникСсылка.Сотрудники"));
    Иначе
        ДопТипы.Добавить(Тип("СправочникСсылка.Контрагенты"));
    КонецЕсли;
    Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов(ДопТипы);

    ПоказыватьДоговор = Истина;
    Если НуженСотрудник Тогда
        ПоказыватьДоговор = Ложь;
    ИначеЕсли ЗначениеЗаполнено(Объект.Получатель)
          И ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
        ТипКонтр = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
            Объект.Получатель, "ТипКонтрагента");
        Если ТипКонтр = Перечисления.ТипыКонтрагентов.Клиент Тогда
            ПоказыватьДоговор = Ложь;
        КонецЕсли;
    КонецЕсли;
    Элементы.Договор.Видимость = ПоказыватьДоговор;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
    ВидОперацииОбновитьФорму();
КонецПроцедуры

&НаСервере
Процедура ВидОперацииОбновитьФорму()
    ВидОп = Объект.ВидОперации;
    НуженСотрудник = (ВидОп = Перечисления.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику)
                  Или (ВидОп = Перечисления.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты);
    БылСотрудник = (ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.Сотрудники"));

    Если ЗначениеЗаполнено(Объект.Получатель) И (БылСотрудник <> НуженСотрудник) Тогда
        Объект.Получатель = Неопределено;
        Объект.Договор    = Справочники.Договоры.ПустаяСсылка();
    КонецЕсли;
    УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
    ПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучательПриИзмененииНаСервере()
    Объект.Договор = Справочники.Договоры.ПустаяСсылка();
    УстановитьВидимость();
КонецПроцедуры
